মাইলস্টোন ৬ এর টেনটেটিভ আউটলাইন: 
আগস্ট ২২: মডিউল ৩০: JS Recap, ES6 Intro
আগস্ট ২৩: মডিউল ৩১: ES6 Recap, More ES6
আগস্ট ২৪: মডিউল ৩০.৫: প্রাকটিস ডে (নো মডিউল)
আগস্ট ২৪: রাত ৯.০০ কন্সেপচুয়াল সেশন 
আগস্ট ২৫: মডিউল ৩২: Getting started with API
আগস্ট ২৬: মডিউল ৩৩: More API With Example
আগস্ট ২৭: মডিউল ৩৩.৫: Short module (Recap)
আগস্ট ২৭: রাত ৯.০০ কন্সেপচুয়াল সেশন 
আগস্ট ২৮: নো Video: API প্রাকটিস ডে
আগস্ট ২৯: মডিউল ৩৪: JavaScript Tricky Concepts
আগস্ট ৩০: মডিউল ৩৫:Object Mastering
আগস্ট ৩১:  মডিউল ৩৫.৫:Practice/Revision Day   
আগস্ট ৩১: রাত ৯.০০ কন্সেপচুয়াল সেশন 
সেপ্টেম্বর ১: মডিউল ৩৬:  এসাইনমেন্ট ৬
সেপ্টেম্বর ২: মাইলস্টোন ৭(মডিউল ৩৬)